{
  "#": "From the card game 'Once Upon A Time'", 
  "@": [
    "A %Aspect %Character, a %Item, and a %{Event}.",
    "A %Character and a %Character %(meet at|find a) %{Place}.",
    "A %Character, a %Aspect %Item, and a %{Event}."
  ], 
  "Aspect": [
    "Beautiful", "Blind", "Brave", "Cursed", "Diseased", "Disguised",
    "Dying", "Empty", "Evil", "Far Away", "Frightened", "Greedy", "Happy",
    "Haunted", "Hidden", "Idle", "Insane", "Long-Lost", "Lost", "Lucky",
    "Poisoned", "Sad", "Secret", "Sleeping", "Stolen", "Stupid",
    "Talking (animal)", "Talking (item)", "That Can Fly", "Tiny", "Ugly",
    "Very Strong", "Very Wise"
  ], 
  "Character": [
    "Beggar", "Bird", "Child", "Cook", "Enemy", "Fairy", "Farm Animal",
    "Farmer", "Fiend", "Frog", "Ghost", "Giant", "Guard", "Horse", "King",
    "Monster", "Murderer", "Old Man", "Old Woman", "Orphan", "Outcast",
    "Parent", "Prince", "Princess", "Queen", "Shepherdess", "Sibling",
    "Spouse", "Stepmother", "Thief", "Troublemaker", "Witch", "Wolf"
  ], 
  "Ending": [
    "\"You have freed me from my enchantment and tomorrow we will be married.\"",
    "And for all I know they may be dancing still.",
    "And he listened to his mother's advice from then on.",
    "And he was reuinted with his family.",
    "And in the course of time they became king and queen.",
    "And never as long as she lived could it be removed.",
    "And she was reunited with her family.",
    "And so he escaped their plan for revenge.",
    "And so the prophecy had been fulfilled.",
    "And the flames rose higher and the evil place was destroyed.",
    "And the king was delighted with such an unusual gift.",
    "And the kingdom rejoiced at the end of the tyrant's reign.",
    "And the parents were reunited with their long-lost child.",
    "And there they sit to this very day.",
    "And they were blind for the rest of their days for their wickedness and falsehood.",
    "And to this day no one knows where she ran to.",
    "And when they died they passed it on to their children.",
    "As dawn broke they could see it was perfect.",
    "Beaten, the foul creature vanished and was never seen again.",
    "But it had vanished as mysteriously as it had appeared.",
    "But no matter how hard they searched they were never able to find it again.",
    "But she still visted them from time to time.",
    "Every day he saw the result of his disobedience, and wept.",
    "Every year she put cherry blossoms on the graves of her children.",
    "He lived the rest of his life as a beggar... which was perfectly just.",
    "He picked up his weapon and went on his way.",
    "He saw the error of his ways and repented.",
    "Her sorrow came to an end and her joy began.",
    "His dedication had broken the spell.",
    "His wound was healed but his heart remained broken forever.",
    "In this way, she avoided the punishment she deserved.",
    "It fit perfectly.",
    "It is said that he will haunt that place until she forgives him.",
    "She always wore it to help remind her.",
    "She never let it out of her sight again.",
    "So everything was restored to its former glory.",
    "So he forgave her and they were married.",
    "So he knew that his visitor had been a monster all along.",
    "So he realized how loyal his brother had been.",
    "So he told her he was the Prince and they lived happily ever after.",
    "So it was transformed back into human form.",
    "So she revealed her true identity and they were married.",
    "So the King agreed to spare his life.",
    "So the King relented and the two were wed.",
    "So the Queen gave them the prize as she had promised.",
    "So the evil-doers wre thrown down a well.",
    "So the riddle was finally answered.",
    "So the rightful ruler was placed once more upon the throne.",
    "So the spell was broken and they were free.",
    "So the village was restored to prosperity.",
    "So they changed places and everything was back to normal.",
    "So they escaped their captors and fled home.",
    "So they promised never to fight again.",
    "So they returned it to its original owner.",
    "The King fulfilled his side of the bargain and everyone was happy.",
    "The curse was lifted as had been foretold.",
    "The farm was returned to its rightful owners.",
    "The monster was destroyed and the farm was safe once more.",
    "They ate it at the feast and it was delicious.",
    "They loooked after it until she was old enough.",
    "They thanked the hero who had saved them all.",
    "They were buried in the same grave, and the kingdom mourned them.",
    "This is the terrible fate that awaits those who commit murder.",
    "True love had broken the enchantment.",
    "When her father saw her babies, he realized he had to allow the marriage.",
    "Which is how the kingdom got its name.",
    "Which proves that a pure heart will always triumph in the end.",
    "Which proves that one should always be careful of one's companions.",
    "Which shows that a good deed will be rewarded in the end.",
    "With the ghost banished, their hardship ended.",
    "With the rival dead hey could get married at last."
  ], 
  "Event": [
    "Argument", "Change Of Ruler", "Chase", "Contest", "Death", "Dream",
    "Escape", "Fight", "Hard Times", "Journey", "Object Breaking",
    "People Meeting", "People Parting Company", "Plan", "Rescue", "Revenge",
    "Someone Is Hurt", "Someone Is Punished", "Someone Is Sent Away",
    "Someone is Punished", "Someone is Sent Away", "Something Is Revealed",
    "Storm", "Swallowed Whole", "Time Passes", "Transformation", "Trap",
    "Two People Fall In Love", "When Someone Disobeys", "When Someone Faints"
  ], 
  "Item": [
    "Axe", "Barrier", "Boat", "Book", "Command", "Crown", "Cure", "Door",
    "Eye", "Fire", "Food", "Gift", "Heart", "Hole", "Key", "Ring",
    "Set of Clothes", "Skull", "Spell", "Sword", "Treasure", "Tree",
    "Window", "Wound"
  ], 
  "Place": [
    "Arena", "Cave", "Chapel", "Cottage", "Daytime", "Farm", "Field",
    "Foreign Land", "Forest", "Grave", "Home", "In Bed", "Island", "Kingdom",
    "Kitchen", "Market", "Mountain", "Nighttime", "Palace", "Prison",
    "River", "Road", "Ruin", "Sea", "Stairs", "Tower", "Town", "Village",
    "Well"
  ]
}
