{
  "#": "Initial data set started from mIRC yiff.txt list with multiple sources each claiming sole credit for the same data... so I'll have to assume none of them are the original author. The data has been edited since. '$2' is meant to be the target of yiffing, '$1' is meant to be the person asking the bot to yiff someone", 
  "@": "%yiff",
  "animal": [
    "bunny", "canine", "cat", "coyote", "deer", "dingo", "dog", "dragon",
    "elephant", "feline", "fox", "hamster", "horse", "kangaroo", "kitty",
    "marmoset", "mink", "mouse", "parrot", "pony", "rabbit", "racoon", "skunk",
    "squirrel", "turtle", "vulpine", "wolf"
  ], 
  "anus": [
    "arse", "backdoor", "brown starfish", "delicious ass", "rear entrance",
    "rosebud", "servant's entrance", "tailhole"
  ], 
  "blogsite": [
    "furaffinity", "livejournal", "tumblr"
  ], 
  "body_digit": [
    "%penis", "finger", "pinky", "thumb"
  ], 
  "bodypart": [
    "collar", "collarbone", "crotch", "finger", "hip", "lips", "shoulder",
    "throat"
  ], 
  "furry_artist": [
    "Doug Winger", "r@yfox"
  ], 
  "mlp_name": [
    "Applejack", "Fluttershy", "Pinkie Pie", "Princess Celestia",
    "Rainbow Dash", "Twilight Sparkle"
  ], 
  "penis": [
    "cock", "dick", "hard rod", "hood", "knot", "knotted cockrope", "manhood",
    "member", "micropenis", "organ for erection", "pecker", "penis", "phallus",
    "prick", "putz", "red rocket", "rod", "shaft", "tool"
  ], 
  "penis_good": [
    "cute little", "engorged", "enormus", "erect", "freaking huge", "gigantic",
    "horse-shaming", "huge", "illegally-sized", "impressive", "massive",
    "meaty", "pulsing", "ridiculous-sized", "throbbing"
  ], 
  "semen": [
    "baby batter", "breeding gravy", "choade", "cockpearls", "come",
    "cum", "ejaculate", "jizz", "manchowder", "milt", "prostate juice",
    "salty coins and milk", "seed", "semen", "seminal fluid", "sperm",
    "spermshake", "thick white fluid"
  ], 
  "some": [
    "four", "over 9000", "three", "two"
  ], 
  "testes": [
    "ballsack", "dicebag", "family jewels", "testes"
  ], 
  "vagina": [
    "axe-wound", "baby-chute", "cunt", "delta of venus", "man-gina",
    "muff", "pink pocket", "poon", "pussy", "tuna tunnel", "va-jay-jay",
    "wondertunnel", "yoni"
  ], 
  "yiff": [
    "%(blasts|pumps|spews) %(gallons|litres) of hot %animal %semen all over $2",
    "%(busts|blasts|shoots|jets) a huge creamy yiffload all over $2",
    "%(sprays|blasts|jets|squirts) %(hot|sticky|slick|warm|delicious|yummy|bitter|tasty|illegal) %semen all over $2",
    "Listen, and understand: that yiffbot is out there. It can't be bargained with, it can't be reasoned with, it doesn't feel pity, or remorse, or fear.  It absolutely will not stop, ever, until you are a murry fur",
    "adds more lensflare to the screenshot of $1's SecondLife fursona. Lensflare makes \\u0002everything\\u0002 better.",
    "aims and shoots, but misses $1 mouth, leaving a mess of %semen dripping down $1's chin",
    "bends $1's first edition Black Lotus",
    "bites off $2's tongue with hir sheath because it has sheathteeth",
    "burns $2's home down and yiffs $1 in the flames",
    "can't enjoy her $2 Sandwich",
    "can't help but fuck the everliving shit out of $2 with a %penis_good %{animal}dick",
    "can't take anymore; sie gasps for hir breath as sie unloads potent %animal seed all over $2's %animal nipples",
    "caresses $2's furry %testes, inhaling $2's sweet musk through hir nostrils, hir %penis starting to grow from all the sensations",
    "checks $1's furaffinity account, disappointed not to see any new submissions",
    "clams $1's crab while cockling her cowrie",
    "clenches hir firm, supple buttocks around the %penis_good head of $2's %animal%penis",
    "clips $2's harness to the stall, then begins to plow hir pony vagina without mercy",
    "critches the inside of $2's %anus with hir entire hand while lapping up the fountain of %semen escaping from $2's %penis_good member",
    "cuddles close to $2, hir excitement poking $2 from behind",
    "cuts off a strip of Pinkie Pie to make some pony jerky",
    "dips hir semihard penis in a cold glass of wine, savouring the sweet feeling, then hands the glass off to $1, who was unaware of the wine-dog-penis love that just went on",
    "does something disgusting to $2", "does the unthinkable to $2",
    "drags a %(foxy|dragon|kitty) claw across the ridges of $2's circumcision scar%{yiffchain}",
    "draws his sixgun and shoots $1 dead",
    "drinks $1's piss thinking that it was apple juice",
    "drives her ovipositor into $2's breast, loading hir up on wasp eggs and venom-riddled DNA",
    "emerges from hir sheath, hir hard %penis glistening in the moist air%{yiffchain}",
    "engulfs $2's %{animal}cock, relishing the salty taste of the precum",
    "exposes hir sheath to $2, while slowly raising hir tail with an inviting look",
    "eyes $1's cubs. Now that sie's the alpha of the pack, is there really any reason why $1 should be wasting her time raising cubs from another male? Sie licks his lips, and unholsters hir pants. No reason for them to die virgins, either...",
    "eyes that drop of %semen with interest, using hir tail to push hir %penis firmly up against $2's %anus, nudging the head against the open ring of flesh",
    "falls backwards on to the bed. Wah! =3 pomf",
    "farts all over $2's %penis",
    "feels $2's %penis throbbing inside hir, each pulse unleashing a firey hot load deep in hir bowels, sating lust momentarily",
    "feels $2's %penis_good %{animal}hood enter hir time and time again, making hir %anus twitch and love juice flow",
    "felt $2's lukewarm %{animal}hood enter hir time and time again, making hir %vagina twitch and love juice flow",
    "fills up $2 with Deep Fried Butter, mayonaise, and half a bucket of lard to make him into her kawaii hump-pillow",
    "forces $1 to find pokemon attractive",
    "fucks $2 so hard that they combine with herself, becoming a two-headed hermaphrodite were-hound",
    "gently slides hir paw over $2's right %bodypart while gliding a %body_digit over hir %anus in anticipation",
    "gently traces the mellow folds of $2's silkworm anus",
    "gets a firm grip on $2's hip as sie thrusts hir %{animal}hood deep within hir tight and inexperienced %anus, unexpectedly ramming the knot causing an orgasm of pain and pleasure for $2",
    "gets arrested for taking advantage of $2",
    "gets down on all fours and humps $2", "gets down with $2 doggie style",
    "gives $2 a nice and solid kick, making hir collapse onto the floor, cupping $2's %animal %testes",
    "gives slow, resistant oral sex to $2 while sad instrumental music is played by an orchestra",
    "glares at $1 and silently judges",
    "goes apeshit and jumps on $2 with a %penis_good %{animal}cock",
    "goes to rape some chirrins and eat some chitlins",
    "grabs $2, twirls hir around like a dancer and places a kiss on hir lips, fondling hir %anus for a second so sie can taste it later",
    "grooms $2's long floppy bunny ears with hir sandpaper cat tongue :3",
    "hails a cab for $2, and when she gets in, the driver reveals that she's in Furry Cash Cab! YEAAAAAH TIME TO YIFF FOR CASH!!!",
    "has died of dysentery",
    "has replaced $2's Folgers crystals with dog semen; let's see if sie notices",
    "howls with pleasure as $1 pulls the knot out of hir hole, stretching it to an obscene size before a loud \"POP\" is heard and $2's %{animal}juice cascades down hir already drenched thighs",
    "initiates the cuddle pile of Cthulu! Fuzzy tentacles lash out and drag $2 into the maw of Murrrrr",
    "inserts a giner into $2's %animal sheef, pumping in and out to create sheefsounds of varying pitches and phonetic properties",
    "is impregnating $1 right now, but as soon as hir knot shrinks, sie'll be ready to yiff $2!!!",
    "is puzzled by $2's merely single cock as it presses against hir %(chest|stomach)",
    "is tired of dealing with $2's dickcheese, so she ties him up and circumsises him with a bread knife",
    "is trying to get a furcut, but $2 the barber's breasts are too big for hir to reach his head!",
    "isn't here right now -- she's attending a cross burning with $2",
    "isn't just sure... she's HIV positive!",
    "joins $1 in the basement over a bound and gagged %mlp_name, ready to teach her a lesson about \"friendship\"",
    "joins the Attracted to Pokemon group on %blogsite and complains about how his parents don't understand his love for lucario",
    "kicks in $1's front door, and installs a glade plugin in every room. Shit's going to be floral as \\u0002HELL\\u0002",
    "laps at $2's drippy cunny while digging poop out of her butt with a spoon to save for later",
    "licks along $2's silky lips, taking $2's exposed %{animal}cock and plays with the tip, rubbing the underside with hir %bodypart slowly towards the tip",
    "licks hir lips while watching $2 fellatiate a %(toy poodle|chihuahua)",
    "lifts her rainbow ponytail and shits all over the carpet",
    "looks at Pritchard. Pritchard looks at $1. $1 looks at the floor. Finally, Sarif speaks up. \"Well, $1? Do you have explanation for how Tai Yong Medical got ahold of those horsecock augmentations?\" $1 clears hir throat. \"Well, sir, it's a long story.\" (PART 1 OF 50)",
    "looks through $2's search history on youtube and wonders why gay kiss shows up so many times",
    "looks up at $2 with a cute wide-eyed look. Hir sweet ice-cream tasting pom-pom is nibbled on, moaning even louder before clinging to hirself tightly at feeling of the licks at hir sensitive pompom. \"ahh ahh! oh! ku-KUPO!\"",
    "milks hir cock and drizzles %semen into the coffee pot to see if $2 can taste the difference",
    "mounts $2 and pumps in and out hard",
    "mounts $2 and thrusts hir %penis_good %[animal]cock deeply in hir tight ass, ramming the bulging knot deeper with each pump, balls smacking against the %anus while hir already %penis_good %penis squirts %semen all inside",
    "murrs as sie slides hir paw over $2's %penis_good %animal %penis",
    "murrs, humping softly against $2's hand, twisting the tip of his finger into $2's lovingly rendered %anus",
    "nibbles softly on the carrot protruding from $2's juicy hole as $2's fluffy bunnytail tickles hir face",
    "overindulges at the stallion banquet",
    "paints a picture of a flower or some shit. Just look at that fucker. Shit. Be. Amazing",
    "parts $2's buttcheeks and slides hir %{animal}cock into their anus",
    "pays $2 to have sex with %mlp_name, the biggest whorse in town",
    "pisses all over $2's fursuit; that's what you get for overwriting my Pokémon savefile!!!",
    "plunges deep into $2's anal cavity getting fur all over the place",
    "pokes a finger into $2's %{glistening|damp|dewy|moist|sticky} sheath, tasting the tip of hir finger in anticipation",
    "pokes holes in all of $1's condoms with a pin, and swaps her birth control pills with tic-tacs. Looks like she'll be having cubs in a couple months! :3",
    "pours water on $1 the goo-girl so hir breasts will get even jubblier :3",
    "props $2's dead furry body over hir chair and furiously humps, climaxing into hir cold cadaver",
    "pushes down on $2's rock hard %animal %penis with hir palm, sliding around with hir %semen",
    "pushes down onto $2's lap with hir weight, thrusting $2's knot deep within hir %anus",
    "pushes hard, and shits out a snowglobe. Inside is a perfectly formed diorama of %mlp_name crashing into the World Trade Center",
    "pushes himself on $2 for a full makeout kiss and pulls away, only for $2 to stand up and continue the action! $1 sits there, horrified between the two",
    "puts hir fingers on $2's mouth to shush hir as sie starts working hir %penis_good %animal %penis",
    "puts hir muzzle between $2's smooth thighs and starts lapping at hir %(slippery|sensitive|erect) %{animal}clit",
    "puts on hir robe and wizard hat and turns $2 into a real boy with all the succulent boy parts sie so enjoys",
    "reports $2 to the Furry Bureau of Investigation after seeing a search for %furry_artist in hir browser history",
    "reseats $2's tecticles and powers $2 on",
    "rides a wheelbarrow of cocks up $2's ass",
    "roasts %{mlp_name}'s marshmellow butthole over a campfire to make a pony smore",
    "rubs $2's %(member|footpaws|knot) while groping at hir crotch with hir feet",
    "rubs $2's %bodypart while groping at hir crotch with hir feet",
    "rubs $2's fuzzy kitty-cat tummy :3",
    "rubs $2's hard %penis while reaching back for some extra tailhole fun",
    "rubs hir paws through $2's %(bum|butt|ass)fuzz, sticking hir muzzle under the %{animal}'s tail giving hir %anus a nice warm lick",
    "rubs hir petite bottom on $2's well-endowed %animal%(cock|rod|member)",
    "runs hir %(fingers|paws) through $2's silky fur, rubbing hir %bodypart to get them excited",
    "runs hir paws along $2's soft and slender thighs, running up to hir %penis_good %{animal}cock",
    "sells $2 to a shiekh for 5 pieces of gold and a goat",
    "shits in $2's outstretched hands",
    "shoves an AK-47 up $2's well-used foxhole",
    "sits in the corner of the room and meows at the walls",
    "slams another magazine into her pistol, and chambers a round, clutching the carton of condoms in her jaws. The President of the United States needed those condoms, by God, and no undead Nazi sons-of-bitches were going to stop her! (PART 15 of 33)",
    "slaps $1 saying \"You have a yiffin problem, bro.\"",
    "slides %some fingers into $2's %(juicy|tight|erect|wet) %vagina while fondling hir sheath",
    "slides hir throbbing %{animal}%penis along $2's luscious %animal breasts, leaving a trail of %semen along hir sweat-glistened chest",
    "slides two fingers into $2's tight and firm %vagina while fondling hir sheathe",
    "slips hir tongue into $2's moist sheath, taking in all the flavors of hir %animal musk",
    "sniffs $2's smooth cloaca before swiping hir forked tongue up and down on it, tasting hir spicy juices",
    "snuggletackles $2 and starts romping on top of hir",
    "squeezes $2's meaty dragon vent, while giving hir a reach-around",
    "steals $2's laptop, and changes the default browser to IE 6.0",
    "sticks hir Willy Wonka in $2's Chocolate Factory",
    "strokes $2's flank, nuzzling up to hir soft furry neck as they spoon",
    "sudo apt-get install furryfox",
    "tailwavies~ at $2, showing an %penis_good, %penis_good %animal%penis",
    "takes $2 and ravages them from behind with a huge %animal boner",
    "takes $2's %penis_good %penis into hir maw and begins suckling like one would their mother's breast",
    "takes $2's entire %animal length into hir mouth, leaking %semen in excitement",
    "takes $2's entire length into hir mouth, gagging as sie swallows the knot",
    "takes a painfully hard grip on $2's %animal%penis from behind and %(jams|forces|shoves|pushes|slams) the knot right up hir %(virgin|tight) %anus",
    "takes a swig of soda, and her breasts get larger. She frowns, and looks at the label on the bottle. \"What the fuck is this? Some kind of moronic BE-fetish story?\"",
    "tapes down $2 to a log and sings campfire songs all night",
    "tells $2 that santa isn't real, and laughs as tears roll down $2's adorable cub cheeks",
    "the Gnome Shaman wields a wand of death! She zaps you! You die... Do you want your possessions identified? (y/n)",
    "the Optical Horse feels his lensflare expand in $2's uterus, locking his 300mm wide zoomcock inside, and making sure that she'll get pregnant with a whole litter of baby Canons",
    "the chihuahua mounts $2's leg and humps furiously",
    "the huge-cocked house-cat tries to squeeze into a cardboard box like Maru, but there isn't room for his 17 inches of feline meat!",
    "thrusts into $2's tailhole with the force of a falcon punch, shattering their pelvis and compressing their spinal column",
    "ties $2 down and recites lines from the Qur'an before beheading $2 with a dull knife",
    "touches snoot to nose, licks, then sets $2 down. ( ._.)",
    "tries to give $2 a facial but A SKELETON POPS OUT",
    "tries to go down on $2's sweet %animal-gina, but is pushed back by hir throbbing %penis",
    "tries to squeeze into a cardboard box that's clearly far too small to accommodate her massive housecat breasts, while $2 films her with a camcorder",
    "tugs on $2's armpit hair, she's craving some nice urethral yiff",
    "twirls around $2's long %animal-neck, planting a kiss on hir big %semen drippipng mouth",
    "used to be a champion beach volleyball player, until the accident at the silicone factory; now she's a fulltime beanbag chair -- well, a loveseat really",
    "vomits %{animal}spunk all over $2. Whoops! Hope you weren't ovulating!",
    "walks in on $2 masturbating to My Little Pony fanart. WHOA BRO, NOT COOL. YOU NEED TO LOCK YOUR FUCKING DOOR",
    "waters $2 with his %penis",
    "wraps his hands around $2's back, moving downward while kissing along his soft yet sturdy chest and abs",
    "yiff yaff pattiwhack, give a dog a boner, this old $2 was arrested for animal abuse",
    "yiffs all over $2"
  ], 
  "yiffchain": [
    ", and then %yiff", "."
  ]
}
